[
    {
        "company": "Factly.in",
        "image": "images/factly-logo.png",
        "position": "Backend Software Developer",
        "duration": "August 2020 to July 2021",
        "description": "Worked in development of a open source CMS ecosystem which is useful for journalism and fact checking for different organisations.  <ul> <li>Backend was developed with microservices architecture and was deployed on <strong>Kubernetes</strong> cluseter on Google Cloud Platform. For development we used docker-compose to spin up dependency services for applications.</li> <li>All microservices was developed in <strong>Golang</strong> with proper unit testing code. <strong>Postgres</strong> was the database of choice, but servers are developed such that Sqlite can be used for quick setup on local machine.</li> <li>Currently the company's website is running on wordpress. I worked on development of all backend microservices and various toolings which were required for migrating existing data and google factcheck articles which are useful for better journalism.</li> <li>For authentication and authorization <strong><a href=\"https://github.com/factly/kavach\">Kavach</a></strong> Server was developed which is integrated with Ory Stack servers to have a good scalable authentication service.</li> <li>The main CMS application is <strong><a href=\"https://github.com/factly/dega\">Dega</a></strong> (a headless CMS) which is used to capture data for articles, factchecks, podcasts etc and exposes it through <strong>GraphQL</strong> APIs.</li> <li>The commercial place to buy/sell datasets is <strong><a href=\"https://github.com/factly/mande\">Mande</a></strong> Application, which can be used as marketplace designed for journalists, where the organisations can buy/sell journalism datasets.</li> <li><strong><a href=\"https://github.com/factly/bindu\">Bindu</a></strong> is application which is used for visualization of datasets (similar to flourish charts). Here you can generate charts from data and also embeddings are generated which can be used to display in websites.</li> <li><strong><a href=\"https://github.com/factly/vidcheck\">Vidcheck</a></strong> is specially designed for video factchecking where user can link video from any URL and can factcheck different parts of video.</li> </ul>  <b>Website: </b> <a href=\"https://factly.org\">Factly.org</a> <br> <b>GitHub: </b> <a href=\"https://github.com/factly\">Factly</a> <br>"
    },
    {
        "company": "Bhaskaracharya Institute For Space Applications and Geo-Informatics",
        "image": "images/bisag.jpg",
        "position": "Project Intern",
        "duration": "May 2019 to July 2019",
        "description": "Developed a general-purpose video analytics software which leveraged Machine Learning algorithms to perform video processing. This software helps to extract analytics information, such as counting number of people or cars in video, number plate detection, color detection of cars, motion frames detection etc, out of the video. This can help make tedious task of video preprocessing for information easier. It can be used as a preprocessor to more advanced AI softwares. <br> <b>GitHub: </b> <a href=\"https://github.com/hetjagani/Video-Analytics-Software\">Video Analytics Software</a> <br>"
    },
    {
        "company": "Ahmedabad University",
        "image": "images/au.png",
        "position": "Teaching Assistant in Computer Programming Lab",
        "duration": "Feb 2020 to April 2020 ",
        "description": "Worked as teaching assistant in the Computer Programming Lab. Taught various basic concepts of python and C programming to students in second semester."
    }
]
